{
  "characters": {
    "yuri": {
      "name": "Yuri Nishimura",
      "defaultLink": "./assets/default.png",
      "crouchLink": "./assets/crouch.png",
      "leaningLink": "./assets/leaning.png"
    }
  },
  "story": {
    "chapter1": {
      "title": "Maniac Classmate",
      "subtitle": "A Halloween Invitation Gone Awry",
      "about": {
        "title": "A Halloween Invitation Gone Awry",
        "paragraph": "Two days ago, you accepted a seemingly normal invitation to spend Halloween at your enigmatic classmate's house. What began as a curious attempt to know her has spiraled into a nightmare. Now confined in her basement, you realize her outward strangeness concealed sinister intentions. Her calm demeanor belies a chilling reality as she toys with you, feeding both sustenance and fear. In this gripping tale of deception and danger, discover the true depths of eccentricity turned malevolence...",
        "image": "./assets/about.jpeg"
      },
      "dialogues": [
        {
          "id": null,
          "action": true,
          "bg": "#",
          "dialogue": "Two nights prior, you had naively accepted an invitation to celebrate Halloween at the residence of your peculiar classmate."
        },
        {
          "id": null,
          "action": true,
          "audio": "./assets/heartbeat.mp3",
          "volume": 0.7,
          "bg": "./assets/bg.jpeg",
          "dialogue": "Now, you find yourself entombed in the dungeon-like basement of her twisted domain."
        },
        {
          "id": null,
          "action": true,
          "dialogue": "You had no clue that she harbored such dark intentions, that her outward strangeness masked a chilling reality."
        },
        {
          "id": null,
          "action": true,
          "dialogue": "As you sit there, the realization sinks in that she's not merely peculiar, but the embodiment of madness. She has taken things far beyond what you could have imagined."
        },
        {
          "id": null,
          "action": true,
          "dialogue": "The deliberate click of her heels descending the basement stairs sends a shiver down your spine, underscoring the seriousness of your situation.",
          "audio": "./assets/slowwalk.mp3"
        },
        {
          "id": null,
          "audio": "./assets/speech1.mp3",
          "volume": 0.3,
          "dialogue": "\"Oh, Finally awake! I was starting to think you’d sleep forever! Isn’t this place just magical, little pet?\""
        },
        {
          "id": null,
          "action": true,
          "audio": "./assets/door.mp3",
          "volume": 0.4,
          "dialogue": "The door creaks open, revealing her distorted smile and haunting giggles, piercing the eerie stillness."
        },
        {
          "id": "yuri",
          "dialogue": "\"Got an itch for food yet, or are you just playing hard to get?\""
        },
        {
          "id": null,
          "action": true,
          "dialogue": "She crouches down teasingly in front of you and surveys your condition. Her voice is tinged with amusement as it echoes into the basement where you're trapped."
        },
        {
          "id": "yuri",
          "dialogue": "\"Here's something so you don't starve to death.\"",
          "type": "crouchLink"
        },
        {
          "id": null,
          "action": true,
          "audio": "https://cdn.pixabay.com/audio/2022/12/29/audio_2fd079020a.mp3",
          "volume": 0.2,
          "item": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fstatic.vecteezy.com%2Fsystem%2Fresources%2Fpreviews%2F019%2F527%2F060%2Fnon_2x%2Fan-8-bit-retro-styled-pixel-art-illustration-of-bread-free-png.png&f=1&nofb=1&ipt=a19d99fbe6f0644c79c5efb83e4f7a092bee42c816002affb0898108268f728e&ipo=images",
          "dialogue": "She offers you a stale loaf of bread."
        },
        {
          "id": "yuri",
          "dialogue": "\"Enjoying your cozy little spot down here? Bet this isn't how you imagined spending Halloween.\"",
          "type": "crouchLink"
        },
        {
          "id": null,
          "action": true,
          "dialogue": "Her words carry a chilling amusement, mixed with a subtle undercurrent of authority, revealing the unsettling depths of her unpredictable and menacing nature."
        },
        {
          "id": null,
          "action": true,
          "dialogue": "She stands before you, offering food with an eerie calmness, silently observing your reaction as you accept it."
        },
        {
          "id": null,
          "action": true,
          "dialogue": "Her gaze remains steady, betraying a twisted fascination with your predicament, a stark contrast to the disturbingly serene way she feeds you, as if relishing the power dynamics at play."
        },
        {
          "id": "yuri",
          "audio": "./assets/laugh.mp3",
          "volume": 0.2,
          "dialogue": "\"But i must say, you're doin' great as my little plaything.\"",
          "type": "leaningLink"
        },
        {
          "id": null,
          "action": true,
          "dialogue": "With a bone-chilling calm, she speaks, voice a blend of command and disconnection. Yuri's unreadable gaze, hinting a twisted pleasure, remains locked on you, prey caught in her eerie, unwavering stare."
        },
        {
          "id": null,
          "type": "#",
          "action": true,
          "dialogue": "Can you escape this nightmare? Proceed with the story below..."
        }
      ]
    }
  },
  "creators": [{ "userId": "8Ad2r", "badge": "Creator", "color": "#cc2b2b" }]
}
